# How to Read Data Using Pandas

## Reding Files Using Pandas

In [2]:
import pandas as pd

from IPython.display import display

In [4]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")
# csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data.csv", index=None, header=True)
# csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data.xlsx", index=None, header=True)

display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Reading Files Using Methods head()

In [5]:
display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Access Columns Data

In [8]:
display(csv_data[["Age"]].head(10))

   Age
0   19
1   21
2   20
3   23
4   31
5   22
6   35
7   23
8   64
9   30

## Access Data Via Row

In [9]:
display(csv_data.iloc[5])

CustomerID                     6
Genre                     Female
Age                           22
Annual Income (k$)            17
Spending Score (1-100)        76
Name: 5, dtype: object

## Displays Certain Data from Rows and Columns

In [10]:
display(csv_data["Age"].iloc[1])
print("Cuplikan Dataset : ?")
display(csv_data.head())

21

Cuplikan Dataset : ?

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Display a Data within Certain Range

In [11]:
print("Menampilkan data ke 5 sampai kurang dari 10 dalam satu baris : ")
display(csv_data.iloc[5:10])

Menampilkan data ke 5 sampai kurang dari 10 dalam satu baris :

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

## Displaying Statistical Information with Numpy

In [13]:
display(csv_data.describe(exclude=["O"]))

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

# Handling Missing Values

## Checks for Existing NULL Values

In [15]:
display(csv_data.isnull().any())

CustomerID                False
Genre                     False
Age                       False
Annual Income (k$)        False
Spending Score (1-100)    False
dtype: bool

## Imputation Missing Value with Mean

In [18]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")
# csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data_missingvalue.csv", index=None, header=True)
# csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data_missingvalue.xlsx", index=None, header=True)
display(csv_data.head())

   CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                 NaN                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                     NaN